app/views/users/index.html.haml

            %td= link_to 'Edit', edit_user_path(user), class: 'btn btn-sm btn-warning'
            - unless user.roles.blank?
---
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = $1  [["user_id", 1]]