app/views/home/index.html.haml

SELECT COUNT(*) FROM "courses"
---
      .fw-bold
        = Course.distinct.count(:user_id)

SELECT COUNT(*) FROM "users"
---
      .fw-bold
        = User.count