app/views/courses/_course.html.haml

SELECT COUNT(*) FROM "lessons" WHERE "lessons"."course_id" = $1  [["course_id", 23]]
---
    .badge.bg-purple
      = course.lessons.count
  .card-footer
    .far.fa-clock