app/views/courses/show.html.haml

-#           %h4.badge.bg-purple.p-2.mt-3
-#             = @course.lessons.count
-#             - if (@course.lessons.count > 1 || @course.lessons.count.zero?)
---
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."course_id" = $1  [["course_id", 23]]
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1 ORDER BY "lessons"."id" ASC LIMIT $2  [["course_id", 34], ["LIMIT", 1]]
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."course_id" = $1  [["course_id", 26]]

                      Access on mobile and tv
              - if @course.lessons.first
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = $1 LIMIT $2  [["course_id", 34], ["LIMIT", 11]]