app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
  def index
    if params[:title]
      @courses = Course.where('title ILIKE ?', "%#{params[:title]}%") # case-insensitive
    else
      # @courses = Course.all
      # @q = Course.ransack(params[:q])
      # @courses = @q.result.includes(:user)

      @ransack_courses = Course.ransack(params[:courses_search], search_key: :courses_search)
      # @courses = @ransack_courses.result.includes(:user)

      @pagy, @courses = pagy(@ransack_courses.result.includes(:user))