app/controllers/home_controller.rb

  def index
    @courses = Course.all.limit(9)
---
SELECT "courses".* FROM "courses" ORDER BY "courses"."created_at" DESC LIMIT $1  [["LIMIT", 9]]

  def activity
    @activities = PublicActivity::Activity.all
---
SELECT "activities".* FROM "activities"