app/controllers/lessons_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
INSERT INTO "lessons" ("title", "course_id", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Lesson 1"], ["course_id", 26], ["created_at", "2021-09-22 11:48:09.897762"], ["updated_at", "2021-09-22 11:48:09.897762"], ["slug", "lesson-1-c9094fa1-65e9-45ee-90ce-c927f6a7418b"]]
---
  def create
    @lesson = Lesson.new(lesson_params)
    authorize(@lesson)
    @course = Course.friendly.find(params[:course_id])
    @lesson.course_id = @course.id
    respond_to do |format|
      if @lesson.save

UPDATE "lessons" SET "title" = $1, "updated_at" = $2 WHERE "lessons"."id" = $3  [["title", "Diving First Lesson"], ["updated_at", "2021-09-22 13:07:48.345625"], ["id", 9]]
---
  def update
    authorize(@lesson)
    respond_to do |format|
      if @lesson.update(lesson_params)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
  def set_lesson
    @course = Course.friendly.find(params[:course_id])