app/controllers/lessons_controller.rb

  def update
    authorize(@lesson)
    respond_to do |format|
      if @lesson.update(lesson_params)
---
UPDATE "lessons" SET "updated_at" = $1 WHERE "lessons"."id" = $2  [["updated_at", "2021-09-22 11:48:09.924792"], ["id", 7]]